parser.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Parser DDSL</title>
<!-- 2013-06-02 Sun 10:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Hongbo Zhang"/>
<link rel="stylesheet" type="text/css" href="stylesheets/styles.css" />
</head>
<body>
<div id="content">
<h1 class="title">Parser DDSL</h1>
<p>
Fan's parser DDSL is fully self-explainable, its runtime has enough
meta-data to reconstruct itself.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Learn the syntax by yourself</h2>
<div class="outline-text-2" id="text-1">
<p>
suppose you have toplevel installed successfully ( see
<a href="./toplevel_support.html">./toplevel_support.html</a>).
</p>

<div class="org-src-container">

<pre class="src src-ocaml"><span style="color: #a52a2a;">$</span> <span style="color: #a52a2a;">#</span>directory <span style="color: #8b2252;">"+fan"</span><span style="color: #a52a2a;">;;</span>
<span style="color: #a52a2a;">$</span> <span style="color: #a52a2a;">#</span>load <span style="color: #8b2252;">"fanTop.cma"</span><span style="color: #a52a2a;">;;</span>
</pre>
</div>

<p>
Now if you want to understand what's the definition for the
syntactic category case
</p>

<div class="org-src-container">

<pre class="src src-ocaml"><span style="color: #228b22;">Fgram</span>.print <span style="color: #228b22;">Format</span>.std_formatter <span style="color: #228b22;">Fsyntax</span>.case <span style="color: #a52a2a;">;;</span>
</pre>
</div>

<p>
The output is something like this:
</p>
<pre class="example">
case:
  [   LA
   [ "|"; L1 case0 SEP "|" -&gt; bar_of_list l

   | pat; "-&gt;"; exp -&gt; `Case (_loc, p, e)
 ]]
</pre>

<p>
Unlike Camlp4, such grammar printer is the original grammar which is
100% honest to the user's input, no computation involved.
</p>

<p>
So you can install the printer in the toplevel and explore
different non-terminals by your self.
</p>

<div class="org-src-container">

<pre class="src src-ocaml"><span style="color: #7a378b;">#install_printer</span> <span style="color: #228b22;">Fgram</span>.print<span style="color: #a52a2a;">;;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">How the parser works</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Where is the lexer?</h2>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="todo TODO">TODO</span> Functional generation</h2>
</div>
</div>
</body>
</html>